; tut07.asm: Ekrana 1000 adet ardýþýk yýldýz yazdýrma örneði.
;
; $nasm -f elf *.asm; ld -m elf_i386 -s -o demo *.o
; $demo
; ***********************************************************************************************************************
;************************************************************************************************************************
;************************************************************************************************************************
;************************************************************************************************************************
;************************************************************************************************************************
;************************************************************************************************************************
;************************************************************************************************************************
;************************************************************************************************************************
;*****************************************
;--------------------------------------------------------------------------------------------------------------------------
; ===DEÐÝÞKENLER-2===
; Segment .bss'te saklanacak ilkdeðersiz deðiþken adlara res/Reserve bellek tahsis direktiflidir.
; RESB	; 1 byte tahsisi
; RESW	; 1 kelime tahsisi
; RESD	; 2 kelime tahsisi
; RESQ	; 4 kelime tahsisi
; REST	; 10 byte tahsisi
;
; Bellekte karma deðiþken (ascii yada hex) deðerlere yer tahsisi ardýþýk sýralýdýr:
; tercih DB "y"	; ASCII  y = 79H (121D)
; sayý1 DW 12345	;12345D = 3039H
; sayý2 DD 12345679	;123456789D = 75BCD15H
; dizi1 TIMES 100 DW 0	; 100 (times) elemanlý 0 ilkdeðerli dizi
;--------------------------------------------------------------------------------------------------------------------------

	section .data
    yýldýzlar times 1000 db "*"

	section .text
    global _start
_start:
    mov edx, 1000	; VeriKayýtçý, mesaj uzunluðu
    mov ecx, yýldýzlar	; SayaçKayýtçý, Yazdýrýlacak mesaj deðiþkeni
    mov ebx,1	; TemelKayýtçý, 1=ekran/stdout dosyasý
    mov eax, 4	; 40=yaz/sys_write komutu
    int 0x80		; Çaðrýyý gerçekleþtir

    mov eax,1	; 1=çýk/sys_exit komutu
    int 0x80		; Çaðrýyý yap